namespace Sharpdev.SDK.Patterns
{
    /// <summary>
    ///     Структурный  шаблон  проектирования,  который  позволяет  объектам   с   несовместимыми
    ///     интерфейсами работать вместе.
    /// </summary>
    /// <remarks>
    ///     Адаптер  (англ. Adapter)  —  структурный  шаблон  проектирования,  предназначенный  для
    ///     организации  использования  функций  объекта,  недоступного   для   модификации,  через
    ///     специально созданный интерфейс.
    /// </remarks>
    public class AdapterAttribute : PatternAttribute
    {
    }
}
